Repository: amnestywebsite/humanity-petitions-salesforce-adapter
Catalog: languages/aip-sf-*.po
Languages: pl_pl

source: Petitions
pl_pl: petycje

source: Customise
pl_pl: Dostosowywanie

source: Customise how data is stored in Salesforce.
pl_pl: Dostosuj sposób przechowywania danych w Salesforce.

source: No
pl_pl: Nie

source: Yes
pl_pl: Tak

source: Signature Count
pl_pl: Liczba sygnatur docelowych

source: Signature Count Settings
pl_pl: Ustawienia liczby podpisów

source: Count method
pl_pl: Metoda zliczania

source: How would a count of signatures for a petition be retrieved.
pl_pl: W jaki sposób liczba podpisów pod petycją zostałaby odzyskana.

source: Field on Object
pl_pl: Pole na obiekcie

source: SOQL Query
pl_pl: Kwerenda SOQL

source: Salesforce Object type
pl_pl: Salesforce

source: Select which Salesforce Object the field is found on
pl_pl: Wybierz obiekt Salesforce, w którym znajduje się pole

source: Salesforce Object field
pl_pl: Odpowiedź Salesforce nieprawidłowa

source: Select which Salesforce field the signature count should be retrieved from
pl_pl: Wybierz pole Salesforce, z którego należy pobrać liczbę podpisów

source: Enter the Salesforce SOQL Query necessary to retrieve the count<br>e.g. <code>SELECT EntityId FROM TopicAssignment WHERE TopicId='{petition}' AND EntityType='Contact'</code>
pl_pl: Wprowadź kwerendę Salesforce SOQL niezbędną do pobrania liczby<br>Przykład.<code>SELECT EntityId FROM TopicAssignment WHERE TopicId='{petition}' AND EntityType='Contact'</code>

source: SOQL Query response field
pl_pl: Odpowiedź Salesforce nieprawidłowa

source: Enter the Salesforce SOQL query response field from which to retrieve the count, e.g. <code>totalSize</code>
pl_pl: Wprowadź pole odpowiedzi zapytania Salesforce SOQL, z którego ma zostać pobrana liczba, np.<code>totalSize</code>

source: Petition
pl_pl: Petycji

source: Petition Settings
pl_pl: Ustawienia petycji

source: Title field
pl_pl: Pole tytuł

source: Date commenced field
pl_pl: Pole Data rozpoczęcia

source: Type field
pl_pl: Pole wpisu

source: Type field value
pl_pl: Wpisz wartość pola

source: Status field
pl_pl: Stan, pole

source: Status field value
pl_pl: Wartość pola stan

source: Signatory
pl_pl: Sygnatariusz

source: Signatory Settings
pl_pl: Ustawienia sygnatariusza

source: First Name field
pl_pl: Pole Imię

source: Last Name field
pl_pl: Pole Nazwisko

source: Email field
pl_pl: Pole wiadomości e-mail

source: Telephone Number field
pl_pl: Pole Numer telefonu

source: Newsletter preferences field
pl_pl: Pole preferencji biuletynu

source: Newsletter preferences value
pl_pl: Wartość preferencji biuletynu

source: Signature
pl_pl: Podpis

source: Signature Settings
pl_pl: Ustawienia podpisu

source: Petition ID field
pl_pl: Pole identyfikatora petycji

source: Signatory ID field
pl_pl: Pole identyfikatora podpisu

source: Default Configuration
pl_pl: Domyślna Konfiguracja

source: Petitions are stored as "Campaign" Objects. WordPress post fields stored are:
pl_pl: Petycje są przechowywane jako obiekty "Kampania". Zapisane pola postów WordPress to:

source: Petition Title
pl_pl: Tytuł petycji

source: Campaign Name
pl_pl: Nazwa kampanii

source: Petition Published Date
pl_pl: Petycja Opublikowano datę

source: Campaign Start Date
pl_pl: Data rozpoczęcia kampanii

source: Additional fields stored are:
pl_pl: Dodatkowe przechowywane pola to:

source: Campaign Type
pl_pl: Typ kampanii

source: Campaign Status
pl_pl: Stan kampanii

source: In Progress
pl_pl: W trakcie

source: Signatories (Users)
pl_pl: Sygnatariusze (Użytkownicy)

source: Users who sign petitions are stored as "Contact" Objects. Form fields stored are:
pl_pl: Użytkownicy, którzy podpisują petycje, są przechowywane jako obiekty "Kontakt". Przechowywane pola formularza to:

source: First Name
pl_pl: Imię

source: Last Name
pl_pl: Nazwisko

source: Email Address
pl_pl: Adres e-mail

source: Telephone (optionally)
pl_pl: Telefon (opcjonalnie)

source: Petition Signatures
pl_pl: Podpisy petycji

source: The relationship between a Petition and a Signatory is a "Campaign Member" Object
pl_pl: Relacja między petycją a sygnatariuszem jest obiektem "Uczestnikiem kampanii"

source: A Campaign Member is not generally something that is directly visible within Salesforce, but it allows one to view which Contacts have signed which Campaigns
pl_pl: Uczestnik kampanii nie jest na ogół czymś, co jest bezpośrednio widoczne w Salesforce, ale pozwala zobaczyć, które kontakty podpisały, które kampanie

source: Please complete the Salesforce configuration prior to modifying these settings.
pl_pl: Przed modyfikacją tych ustawień należy ukończyć konfigurację Salesforce.

source: You need to create a Connected App to generate your Client ID/Secret keys; see %2$s for further details.%1$s
pl_pl: Musisz utworzyć połączoną aplikację, aby wygenerować klucze identyfikatora klienta/klucze tajne; zobacz %2$s, aby uzyskać więcej szczegółów.%1$s

source: Please ensure that your Connected App has the following oAuth permissions: %2$s.%1$sThe Callback URL must be set to this: %3$s.
pl_pl: Upewnij się, że połączona aplikacja ma następujące uprawnienia oAuth: %2$s.%1$sDodatkowo adres URL wywołania połączenia musi być ustawiony na następujące: %3$s

source: When using the default configuration, please ensure that you have permission to modify the %2$s setting on the %3$s object via the API; see %4$s for more information.%1$sIf customising the configuration, please ensure that you are able to modify all fields you select.
pl_pl: Korzystając z konfiguracji domyślnej, upewnij się, że masz uprawnienia do modyfikowania ustawienia %2$s w obiekcie %3$s za pośrednictwem interfejsu API; zobacz %4$s, aby uzyskać więcej informacji.%1$sJeśli dostosować konfigurację, upewnij się, że możesz zmodyfikować wszystkie wybrane pola.

source: Configure the means of storing petition data
pl_pl: Skonfiguruj sposoby przechowywania danych petycji

source: Type/Status fields
pl_pl: Pola Typ/Stan

source: If the Salesforce Object supports a "Type" and/or a "Status" field, an additional setting will appear in the relevant place upon your selection which will allow you to choose/enter the appropriate value for the field
pl_pl: Jeśli obiekt Salesforce object obsługuje pole "Typ" i/lub "Status", w odpowiednim miejscu po wybraniu pojawi się dodatkowe ustawienie, które umożliwi wybranie/wprowadzenie odpowiedniej wartości dla tego pola.

source: Configure the means for retrieving the count of signatories on a petition
pl_pl: Skonfiguruj środki do pobierania liczby sygnatariuszy petycji

source: Options
pl_pl: Opcje

source: Retrieve the count from an existing field on a Salesforce Object
pl_pl: Pobieranie liczby z istniejącego pola w obiekcie Salesforce

source: Perform a query on the Salesforce API. This is useful when the petitions are not stored as Objects in Salesforce
pl_pl: Wykonaj kwerendę na interfejsie API Salesforce. Jest to przydatne, gdy petycje nie są przechowywane jako obiekty w Salesforce

source: Configure the means of storing user data
pl_pl: Konfigurowanie środków przechowywania danych użytkownika

source: Configure the means of storing petition signature data
pl_pl: Konfigurowanie sposobów przechowywania danych podpisu petycji

source: This is the relationship between a petition and a signatory
pl_pl: Jest to związek między petycją a sygnatariuszem

source: Click this link to complete the Salesforce Connected App authorisation
pl_pl: Kliknij ten link, aby ukończyć autoryzację aplikacji Salesforce Connected App

source: Authorise
pl_pl: Zezwolić
